-- калорийность в ккал на 100г продукта
CREATE TABLE products (
    id SERIAL PRIMARY KEY ,
    name VARCHAR(255) NOT NULL UNIQUE,
    proteins FLOAT NOT NULL, 
    fats FLOAT NOT NULL, 
    carbs FLOAT NOT NULL, 
    calories INT NOT NULL 
);

INSERT INTO products(name, proteins, fats, carbs, calories) VALUES
('Гречка', 12.6, 2.6, 68.0, 329),
('Рис', 7.0, 0.6, 73.7, 323),
('Геркулес', 13.1, 6.2, 65.7, 355),
('Молоко', 2.8, 3.2, 4.7, 58),
('Творог', 18.0, 0.6, 1.5, 86),
('Яйцо', 12.7, 11.5, 0.7, 157),
('Баранина', 16.3, 15.3, 0.0, 203),
('Говядина', 18.9, 12.4, 0.0, 187),
('Конина', 20.2, 7.0, 0.0, 143),
('Кролик', 20.7, 12.9, 0.0, 199),
('Телятина', 19.7, 1.2, 0.0, 90),
('Курица', 20.8, 8.8, 0.6, 165),
('Индейка', 21.6, 12.0, 0.8, 197),
('Баклажаны', 0.6, 0.1, 5.5, 24),
('Бананы', 1.5, 0.0, 22.4, 91),
('Капуста', 2.5, 0.0, 4.9, 29),
('Картофель', 2.0, 0.1, 19.7, 83),
('Морковь', 1.3, 0.1, 7.0, 33),
('Редька', 1.9, 0.0, 7.0, 34),
('Фасоль', 4.0, 0.0, 4.3, 32),
('Горбуша', 21.0, 7.0, 0.0, 147),
('Судак', 19.0, 0.8, 0.0, 83),
('Щука', 18.8, 0.7, 0.0, 82),
('Свинина', 16.0, 32.0, 0.0, 395),
('Шоколад', 5.4, 35.3, 56.5, 546),
('Яблоки', 0.4, 0.4, 11.3, 48),
('Апельсины', 0.9, 0.2, 8.1, 36),
('Сыр', 23.0, 30.0, 0.0, 371),
('Киви', 1.0, 0.6, 10.3, 48),
('Овсянка', 11.9, 5.8, 65.4, 342),
('Шпинат', 2.9, 0.4, 2.3, 21);

