
message_dict = {
    'welcome': "Приветствую, меня зовут Питательный Помощник! Я помогу вам с вопросами о питании и здоровом образе жизни.\n\nДля начала, давайте зарегистрируемся. Сколько вам лет?",
    'error': "Что-то пошло не так. Попробуйте еще раз.",
    'already_registered': "Здесь будет описание всевозможных команд!",

    'ask_age': "Сколько вам лет?",
    'young_age': 'Ого, так молодо! Но это не помешает нам продолжить😄.\nВведите свой рост.',
    'normal_age': 'Отлично! Теперь укажите ваш рост в сантиметрах.',
    'old_age': 'Возраст - это просто цифра, главное - дух! Продолжаем🚀.\nВведите свой рост.',
    'wrong_age': 'Пожалуйста, введите ваш возраст числом.\nПопробуем ещё раз?',
    'negative_age': 'Очень смешно, но давайте все же введите ваш возраст ПОЛОЖИТЕЛЬНЫМ числом.\nПопробуем ещё раз?',

    'negative_height': 'Отрицательный рост? Похоже на то что вы ведущий новостей на первом канале.\nНо давайте все же введите ваш рост ПОЛОЖИТЕЛЬНЫМ числом. Попробуем ещё раз?',
    'short_height': 'А вы довольно низкий!😄.\nВведите свой вес.',
    'normal_height': 'Отлично! Теперь укажите ваш вес в килограммах.',
    'tall_height': 'Вау, вы такой высокий!😄.\nВведите свой вес.',
    'wrong_height': 'Пожалуйста, введите ваш рост числом.\nПопробуем ещё раз?',

    'negative_weight': 'Это слиишком маленький вес. Введите ваш вес ПОЛОЖИТЕЛЬНЫМ числом.\nПопробуем ещё раз?',
    'light_weight': 'Вы такой легкий!😄.\nУкажите ваш уровень физической активности.',
    'normal_weight': 'Отлично! Теперь укажите ваш уровень физической активности.',
    'heavy_weight': 'Вам точно необходима моя помощь🤡.\nУкажите ваш уровень физической активности.',
    'wrong_weight': 'Пожалуйста, введите ваш вес числом.\nПопробуем ещё раз?',

    'goal': "Какая у вас цель?",
    'gender': "Извиняюсь за нескромный вопрос, но какого вы пола?",
    'finish': "Спасибо за регистрацию! Теперь вы можете пользоваться всеми моими функциями. Для вызова списка команд введите /help",
}