
message_dict = {
    'welcome': "Приветствую, меня зовут Питательный Помощник! Я помогу вам с вопросами о питании и здоровом образе жизни.\n\nДля начала, давайте зарегистрируемся. Сколько вам лет?",
    'already_registered': "--PLACEHOLDER-- Здесь будет описание всевозможных команд!",

    'ask_age': "Сколько вам лет?",
    'young_age': 'Ого, так молодо! Но это не помешает нам продолжить😄.\n Введите свой рост.',
    'normal_age': 'Отлично! Теперь укажите ваш рост в сантиметрах.',
    'old_age': 'Возраст - это просто цифра, главное - дух! Продолжаем🚀. Введите свой рост.',
    'wrong_age': 'Пожалуйста, введите ваш возраст числом. Попробуем ещё раз?',


}