
message_dict = {
    'welcome': "Приветствую, меня зовут Питательный Помощник! Я помогу вам с вопросами о питании и здоровом образе жизни.\n\nДля начала, давайте зарегистрируемся. Сколько вам лет?",
    'already_registered': "--PLACEHOLDER-- Здесь будет описание всевозможных команд!",

    'ask_age': "Сколько вам лет?",
    'young_age': 'Ого, так молодо! Но это не помешает нам продолжить😄.\n Введите свой рост.',
    'normal_age': 'Отлично! Теперь укажите ваш рост в сантиметрах.',
    'old_age': 'Возраст - это просто цифра, главное - дух! Продолжаем🚀.\n Введите свой рост.',
    'wrong_age': 'Пожалуйста, введите ваш возраст числом.\n Попробуем ещё раз?',
    'negative_age': 'Очень смешно, но давайте все же введите ваш возраст ПОЛОЖИТЕЛЬНЫМ числом.\nПопробуем ещё раз?',

    'negative_height': 'Отрицательный рост? Похоже на то что вы ведущий новостей на первом канале.\nНо давайте все же введите ваш рост ПОЛОЖИТЕЛЬНЫМ числом. Попробуем ещё раз?',
    'short_height': 'А вы довольно низкий!😄.\n Введите свой вес.',
    'normal_height': 'Отлично! Теперь укажите ваш вес в килограммах.',
    'tall_height': 'Вау, вы такой высокий!😄.\n Введите свой вес.',
    'wrong_height': 'Пожалуйста, введите ваш рост числом.\nПопробуем ещё раз?',
}